"""
循环遍历
"""
# list1=[1,2,3,4,5]
# for i in list1:#从list1中循环取值，赋值给i
#     print(i,end="\t")
# for i in range(1,10):#包前不包尾  range 是迭代器  只会打印出来1，2，3，4，5，6，7，8，9
#     print(i,end=",")

# 列表推导式，列表元素生成
# list1=[i for i in range(1,11)]  #列表的元素是i，不能省去，否则循环生成，不知道把什么放在列表中
# print(list1)

"""
列表切片:获取列表的局部数据
切片的语法格式:
  存储对象[开始索引:结束索引:步长]

"""
#      0,1,2,3,4,5,6
list1 = [1, 2, 3, 4, 5, 6, 7]
# print(list1[1:3:1])#切片包前不包尾，打印出来2，3   默认步长1list1[1:3:],list1[1:3]格式都正确
print(list1[3:1:-1])  # 索引降序输出list1[3:1:],list1[3:1]会报错  只有1可以省略

#    -7,-6,-5,-4,-3,-2,-1
list1 = [1, 2, 3, 4, 5, 6, 7]  # 索引可以利用上述搜索
print(list1[-7:-3:])
print(list1[-7:-3])
print(list1[-7:-3:1])  # 可见1可以省略，但是-1不能省略
